# Dotfiles Brewfile
# Install all packages: brew bundle --file=~/dotfiles/brew/Brewfile
# Updated: 2026-02-06

# ============================================================================
# Core System Tools
# ============================================================================

# GNU tools (replace macOS defaults)
brew "autoconf"
brew "binutils"
brew "coreutils"
brew "diffutils"
brew "ed"
brew "findutils"
brew "flex"
brew "gawk"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-which"
brew "gpatch"
brew "grep"
brew "gzip"
brew "less"
brew "m4"
brew "make"
brew "nano"
brew "screen"
brew "watch"
brew "wdiff"
brew "wget"
brew "zip"

# Essential utilities
brew "moreutils"  # sponge, etc.
brew "openssh"
brew "php"
brew "gmp"

# ============================================================================
# Development Tools
# ============================================================================

# Version Control
brew "git"
brew "git-lfs"
brew "gh"  # GitHub CLI
brew "subversion"

# ============================================================================
# Kubernetes & Container Tools
# ============================================================================

brew "kubernetes-cli"
brew "helm"
brew "kustomize"
brew "kompose"
brew "openshift-cli"
brew "kube-ps1"
tap "derailed/k9s"
brew "derailed/k9s/k9s"

# Container tools
brew "dive"  # Docker image explorer
tap "buildpacks/tap"
brew "buildpacks/tap/pack"

# ============================================================================
# Cloud & Infrastructure
# ============================================================================

brew "ansible"
brew "terraform"  # If needed

# ============================================================================
# Programming Languages & Tools
# ============================================================================

# Go
brew "go"

# Node.js
brew "nvm"
tap "oven-sh/bun"
brew "oven-sh/bun/bun"
brew "pnpm"

# Python
brew "pyenv"

# Java/Spring
tap "spring-io/tap"
brew "spring-io/tap/spring-boot"

# Database
brew "liquibase"
brew "redis"

# ============================================================================
# CLI Productivity Tools
# ============================================================================

# Modern CLI replacements
brew "exa"       # Better ls
brew "fzf"       # Fuzzy finder
brew "ripgrep"   # Better grep
brew "fd"        # Better find
brew "zoxide"    # Smarter cd
brew "zellij"    # Terminal multiplexer (tmux alternative)
brew "yazi"      # Terminal file manager (ranger alternative)
brew "bat"       # Better cat (if you want it)

# Git tools
tap "jesseduffield/lazygit"
brew "jesseduffield/lazygit/lazygit"
brew "ghq"  # Repository manager

# Other utilities
brew "jq"        # JSON processor
brew "tree"
brew "tmux"
brew "ncdu"      # Disk usage analyzer
brew "telnet"
brew "tldr"      # Simplified man pages
brew "oha"       # HTTP load generator
brew "hugo"      # Static site generator
brew "marp-cli"  # Markdown presentations
brew "jsonnet"
brew "asciidoctor"

# Network tools
brew "kcat"  # Kafka CLI

# File tools
brew "sevenzip"
brew "pigz"
brew "pv"
brew "rename"
brew "zopfli"

# Media tools
brew "ffmpeg"
brew "poppler"  # PDF tools
brew "imagemagick"
brew "gs"  # Ghostscript

# Misc
brew "ack"
brew "lua"
brew "lynx"
brew "rlwrap"
brew "ssh-copy-id"
brew "vbindiff"
brew "neofetch"
# brew "ngrok/ngrok/ngrok"
brew "mkcert"

# ============================================================================
# Security & CTF Tools (Optional - comment out if not needed)
# ============================================================================

brew "aircrack-ng"
brew "bfg"
brew "binwalk"
brew "cifer"
brew "dex2jar"
brew "dns2tcp"
brew "fcrackzip"
brew "foremost"
brew "hashpump"
brew "hydra"
brew "john"
brew "knock"
brew "netpbm"
brew "nmap"
brew "pngcheck"
brew "socat"
brew "sqlmap"
brew "tcpflow"
brew "tcpreplay"
brew "tcptrace"
brew "ucspi-tcp"
# brew "xpdf"  # Removed: Conflicts with poppler. Poppler is more widely used and already provides all PDF CLI tools.
brew "xz"

# ============================================================================
# Shell Enhancements
# ============================================================================

brew "zsh-syntax-highlighting"

# ============================================================================
# GUI Applications
# ============================================================================

# Development
cask "iterm2"
cask "visual-studio-code"
# cask "sublime-text"
# cask "jetbrains-toolbox"
# cask "ghostty"

# Productivity
# cask "raycast"
# cask "rectangle"     # Window manager
# cask "alt-tab"       # Better app switcher
# cask "notion"
# cask "obsidian"      # If you use it
# cask "snipaste"      # Screenshot tool

# Communication
# cask "slack"
# cask "microsoft-teams"
# cask "zoom"          # If needed

# Utilities
# cask "appcleaner"
# cask "keka"          # Archive utility
# cask "kekaexternalhelper"
# cask "keycastr"      # Show keystrokes
# cask "macdown"       # Markdown editor
# cask "iina"          # Video player
# cask "spotify"
# cask "bitwarden"     # Password manager

# Database & Dev Tools
# cask "dbeaver-community"
# cask "beyond-compare"
# cask "drawio"

# System
# cask "switchhosts"   # Hosts file manager
cask "karabiner-elements"
# cask "openvpn-connect"
# cask "aerial"        # Screensaver

# Email
# cask "mimestream"    # Gmail client

# ============================================================================
# Fonts
# ============================================================================

tap "homebrew/cask-fonts"
cask "font-fira-code-nerd-font"

# ============================================================================
# Notes
# ============================================================================
# Removed tools (not used):
# - orbstack, colima (using Docker Desktop)
# - sfnt2woff, sfnt2woff-zopfli, woff2 (font tools not needed)
#
# To install:
#   brew bundle --file=~/dotfiles/brew/Brewfile
#
# To cleanup unused packages:
#   brew bundle cleanup --file=~/dotfiles/brew/Brewfile
